
#include "Serial_Com.h"

//***********************************************************************
//串口初始化函数
void UART_Init(void)
{
	TMOD&=0x0f;
	TMOD|=0x20;   //将定时器1设置为方式2
	TH1=0xfd;     //设置波特率为9600bps
	TL1=0xfd;
	TR1=1;        //启动定时器1
	
	SCON|=0x50;   //将串口设置为方式1，允许接受数据
}

//***********************************************************************
//发送一个字节函数
void UART_SendByte(uchar uDat)
{
	SBUF=uDat;
	while(!TI);  //等待数据发送完，发送完TI=1
	TI=0;        //软件清零
}

//***********************************************************************
//发送一个字符串的函数
void UART_SendStr(uchar *pStr)
{
	while(*pStr!='\0')
	{
		UART_SendByte(*pStr++);
	}
}